Revit 2024 API
BuiltInFailures.SiteFailures.EnterValueOrFormula Property
 Enter a value or a formula starting with '='.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EnterValueOrFormula { get; }
Visual Basic
Public Shared ReadOnly Property EnterValueOrFormula As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EnterValueOrFormula {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace